Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/irish_citizenship/irish_citizenship_through_birth_or_descent.html.txt.tmx
Source language: en
Languages: ga

source: • A person born on the island of Ireland who has made a declaration of alienage on form 13 (pdf) under Section 21 of the Irish Nationality and Citizenship Act 1956 (that is, a person who has declared that they are no longer an Irish citizen)
ga: • Duine a saolaíodh ar oileán na hÉireann agus a rinne dearbhú eachtrannais san fhoirm 13 (pdf) faoi Alt 21 d’Acht Náisiúntachta agus Saoránachta Éireann 1956 (.i. duine a dhearbhaigh nach saoránach d’Éireann a thuilleadh é nó í)

source: Such a person can resume Irish citizenship by making a declaration using form 1 (pdf)
ga: Féadfaidh an duine sin saoránacht d’Éirinn a athshealbhú dóibh féin trí dhearbhúchán a dhéanamh san fhoirm 1 (pdf)

source: These forms are available from the Irish Naturalisation and Immigration Service or your nearest Irish embassy or consular office
ga: Tá fáil ar na foirmeacha a gcuirtear síos orthu thuas ón tSeirbhís na hÉireann um Eadóirseacht agus Inimirce nó ón ambasáid Éireannach nó ón oifig chonsalachta is gaire duit
